In [25]:
import pandas as pd
train_df = pd.read_csv('data/train.csv', header=0)
test_df = pd.read_csv('data/test.csv', header=0)
y = train_df['Survived']

full = pd.concat([train_df , test_df]) # concatenate two dataframesSURV = 891

SURV = 891
full.info()   # info about dataframe

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1309 entries, 0 to 417
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
dtypes: float64(3), int64(4), object(5)
memory usage: 132.9+ KB

In [27]:
full['CabinType'] = full['Cabin'].astype(str).str[0]
full['_CabinType'] = pd.Categorical(full.CabinType).codes

full['CabinType2'] = full['Cabin'].astype(str).str[0:2]
full['_CabinType2'] = pd.Categorical(full.CabinType2).codes

                  count    sum      mean
Pclass CabinType
1      A             15    7.0  0.466667
       B             47   35.0  0.744681
       C             59   35.0  0.593220
       D             29   22.0  0.758621
       E             25   18.0  0.720000
       T              1    0.0  0.000000
       n             40   19.0  0.475000
2      D              4    3.0  0.750000
       E              4    3.0  0.750000
       F              8    7.0  0.875000
       n            168   74.0  0.440476
3      E              3    3.0  1.000000
       F              5    1.0  0.200000
       G              4    2.0  0.500000
       n            479  113.0  0.235908

In [28]:
full['_Sex'] = pd.Categorical(full.Sex).codes
full['_Embarked'] = pd.Categorical(full.Embarked).codes

In [30]:
cols = ['Age','_Embarked','Fare','Parch','Pclass','_Sex','SibSp','Survived','_CabinType']
# full[cols].corr()

In [34]:
# atribuindo 's' para as duas que estavam nula
full.at[62,'Embarked'] = 'S'
full.at[830,'Embarked'] = 'S'

In [ ]:
full.at[1044,'Fare'] = 7.925